# Reading data from a SQL database
If youâ€™re working with data from a SQL database you need to first establish a connection using an appropriate Python library, then pass a query to pandas. Here we'll use SQLite to demonstrate.
First, we need pysqlite3 installed

In [1]:
!pip install pysqlite3

Collecting pysqlite3
  Downloading https://files.pythonhosted.org/packages/63/f9/d768ba1522852672b49f4ea3cf8c9f21743cc3a0c966fd4809add6133e67/pysqlite3-0.4.1.tar.gz (40kB)
Building wheels for collected packages: pysqlite3
  Running setup.py bdist_wheel for pysqlite3: started
  Running setup.py bdist_wheel for pysqlite3: finished with status 'done'
  Running setup.py clean for pysqlite3
Failed to build pysqlite3
Installing collected packages: pysqlite3
  Running setup.py install for pysqlite3: started
    Running setup.py install for pysqlite3: finished with status 'done'
Successfully installed pysqlite3

sqlite3 is used to create a connection to a database which we can then use to generate a DataFrame through a SELECT query.

In [3]:
!pip install pyodbc

Requirement already satisfied: pyodbc in c:\programdata\anaconda3\lib\site-packages (4.0.25)

Connect pyhton to sql server

In [6]:
import pyodbc 
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=localhost;'
                      'Database=Training;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()
cursor.execute('SELECT * FROM Training.dbo.Person')

for row in cursor:
    print(row)

('Bwalya', 10, 'Lusaka    ')
('Mulenga', 15, 'Lusaka    ')
('Mercy', 9, 'Kitwe     ')
('Bupe', 7, 'Chingola  ')
('Gwen', 8, 'Choma     ')

In [7]:
df = pd.read_sql_query("SELECT * FROM person", con)

NameError: name 'pd' is not defined

In [8]:
#Imports
import pandas as pd

In [17]:
df = pd.read_sql_query("SELECT * FROM person", conn)

In [18]:
df

      Name  Age        City
0   Bwalya   10  Lusaka
1  Mulenga   15  Lusaka
2    Mercy    9  Kitwe
3     Bupe    7  Chingola
4     Gwen    8  Choma

What if we just want specific data in our df

In [15]:
df = pd.read_sql_query("SELECT  Person.Name,Person.Age, Person.City FROM person WHERE City ='Lusaka'", conn)

In [16]:
df

      Name  Age        City
0   Bwalya   10  Lusaka
1  Mulenga   15  Lusaka